spec/host_app/app/controllers/posts_controller.rb

  def index
    @posts = Post.all.page
---
SELECT  "posts".* FROM "posts" LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "qweqwe"], ["created_at", 2016-07-14 10:04:39 UTC], ["updated_at", 2016-07-14 10:04:39 UTC]]